Merge pull request #93 from phatnt199/docs/tuananh/ra-core-infra
Docs/tuananh/ra core infra
